app/controllers/rats_controller.rb

  def index
    @rats = Rat.all
---
SELECT `rats`.* FROM `rats`