app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY users.name DESC
---
  def index
    @users = User.sorted
    @teams = User.uniq_team_id.where.not(:team_id => nil)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @users = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @users = User.find(params[:id])

INSERT INTO `users` (`name`, `team`, `created_at`, `updated_at`) VALUES ('Bob Hunt', 'Reseller', '2016-07-04 19:45:28', '2016-07-04 19:45:28')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save